<!-- tofu-plan-comment -->
## OpenTofu Plan
Real plans using remote backend and AWS credentials.

### dev
<details><summary>Plan for dev</summary>

```diff

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # module.ecs.aws_ecs_service.user will be updated in-place
  ~ resource "aws_ecs_service" "user" {
        id                                 = "arn:aws:ecs:us-east-1:660170479310:service/webapp-cluster/webapp-user-svc"
        name                               = "webapp-user-svc"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:660170479310:task-definition/webapp-user:72" -> "arn:aws:ecs:us-east-1:660170479310:task-definition/webapp-user:66"
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.worker will be updated in-place
  ~ resource "aws_ecs_service" "worker" {
        id                                 = "arn:aws:ecs:us-east-1:660170479310:service/webapp-cluster/webapp-worker-svc"
        name                               = "webapp-worker-svc"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:660170479310:task-definition/webapp-worker:113" -> "arn:aws:ecs:us-east-1:660170479310:task-definition/webapp-worker:96"
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.frontend.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E1EJXL9C4S3V7N"
        tags                           = {}
        # (20 unchanged attributes hidden)

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "clan-boards-frontend.s3.us-east-1.amazonaws.com" -> null
          - origin_id           = "clan-boards-frontend" -> null
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "clan-boards-frontend.s3.us-east-1.amazonaws.com"
          + origin_id           = "clan-boards-frontend"

          + s3_origin_config {}
        }

        # (3 unchanged blocks hidden)
    }

  # module.waf.aws_wafv2_ip_set.interface_v4_cf[0] will be created
  + resource "aws_wafv2_ip_set" "interface_v4_cf" {
      + addresses          = [
          + "136.49.223.111/32",
        ]
      + arn                = (known after apply)
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "webapp-interface-v4-cf"
      + name_prefix        = (known after apply)
      + scope              = "CLOUDFRONT"
      + tags_all           = (known after apply)
    }

  # module.waf.aws_wafv2_ip_set.interface_v4_regional[0] will be created
  + resource "aws_wafv2_ip_set" "interface_v4_regional" {
      + addresses          = [
          + "136.49.223.111/32",
        ]
      + arn                = (known after apply)
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "webapp-interface-v4-regional"
      + name_prefix        = (known after apply)
      + scope              = "REGIONAL"
      + tags_all           = (known after apply)
    }

  # module.waf.aws_wafv2_web_acl.interface_cf[0] will be created
  + resource "aws_wafv2_web_acl" "interface_cf" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "webapp-interface-cf"
      + name_prefix                 = (known after apply)
      + scope                       = "CLOUDFRONT"
      + tags_all                    = (known after apply)

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "allow-interface-v4"
          + priority = 0

          + action {
              + allow {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "allow-interface-v4"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "webapp-interface-cf"
          + sampled_requests_enabled   = true
        }
    }

  # module.waf.aws_wafv2_web_acl.interface_regional[0] will be created
  + resource "aws_wafv2_web_acl" "interface_regional" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "webapp-interface-regional"
      + name_prefix                 = (known after apply)
      + scope                       = "REGIONAL"
      + tags_all                    = (known after apply)

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "allow-interface-v4"
          + priority = 0

          + action {
              + allow {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "allow-interface-v4"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "webapp-interface-regional"
          + sampled_requests_enabled   = true
        }
    }

Plan: 4 to add, 3 to change, 0 to destroy.
```
</details>
